In [10]:
import pandas as pd

# df=pd.read_json("sample_Data.json")
# print('Dispaly thr info of data set')

# print(df.info(10))

In [11]:
data={
    "Name": ['Ram', 'shyam', 'jadu'],
    "age": [10, 20, 30],
    "city": ['Nagpur','Mambi','Delhi']
}

df=pd.DataFrame(data)
print('Dispaly thr info of data set')

print(df.info(10))

Dispaly thr info of data set
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   age     3 non-null      int64
 2   city    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes
None

## Descrive method

In [12]:
data={
    "Name":['ram','sam','choku','moku','chadu','raj','simran','moinak'],
    "age":[10,20,30,40,50,60,70,80],
    "salary":[50000,6000000,3000000,7000000,48000,67000,40000,56899],
    "parformance Score":[86,76,46,98,56,47,68,90]

}

df=pd.DataFrame(data)
print("same dataframe")
print(df)

print(df.describe())

same dataframe
     Name  age   salary  parformance Score
0     ram   10    50000                 86
1     sam   20  6000000                 76
2   choku   30  3000000                 46
3    moku   40  7000000                 98
4   chadu   50    48000                 56
5     raj   60    67000                 47
6  simran   70    40000                 68
7  moinak   80    56899                 90
             age        salary  parformance Score
count   8.000000  8.000000e+00           8.000000
mean   45.000000  2.032737e+06          70.875000
std    24.494897  2.950980e+06          19.910066
min    10.000000  4.000000e+04          46.000000
25%    27.500000  4.950000e+04          53.750000
50%    45.000000  6.194950e+04          72.000000
75%    62.500000  3.750000e+06          87.000000
max    80.000000  7.000000e+06          98.000000

## Shape and Columns

In [13]:
print(f'shape: {df.shape}')
print(f'column Names:{df.columns}')

shape: (8, 4)
column Names:Index(['Name', 'age', 'salary', 'parformance Score'], dtype='object')

## Select specific column
## filter rows
## combine multiple condition

####### single coloum

In [14]:
df=pd.DataFrame(data)
print(df)
print("Name (single column return series)")

name=df['Name']
print(name)

     Name  age   salary  parformance Score
0     ram   10    50000                 86
1     sam   20  6000000                 76
2   choku   30  3000000                 46
3    moku   40  7000000                 98
4   chadu   50    48000                 56
5     raj   60    67000                 47
6  simran   70    40000                 68
7  moinak   80    56899                 90
Name (single column return series)
0       ram
1       sam
2     choku
3      moku
4     chadu
5       raj
6    simran
7    moinak
Name: Name, dtype: object

## Multiple column

In [15]:
subset=df[["Name","salary","parformance Score"]]

print ("subset with Name and Salary:")
print(subset)

subset with Name and Salary:
     Name   salary  parformance Score
0     ram    50000                 86
1     sam  6000000                 76
2   choku  3000000                 46
3    moku  7000000                 98
4   chadu    48000                 56
5     raj    67000                 47
6  simran    40000                 68
7  moinak    56899                 90

## Rows filter

In [16]:
high_salary=df[df['salary']>50000]
print("50000 salary high")
print(high_salary)

50000 salary high
     Name  age   salary  parformance Score
1     sam   20  6000000                 76
2   choku   30  3000000                 46
3    moku   40  7000000                 98
5     raj   60    67000                 47
7  moinak   80    56899                 90

## filtering rows salary >50k && age>30

In [17]:
filter=df[(df['salary']>50000) & (df['age']>30)]
print("50000 salary and age >30")
print(filter)

50000 salary and age >30
     Name  age   salary  parformance Score
3    moku   40  7000000                 98
5     raj   60    67000                 47
7  moinak   80    56899                 90

## performence >90 or age >35

In [18]:
filter_or=df[(df['parformance Score']>90) | (df['age']>35)]
print("performence score >90 && age >35")
print(filter_or)

performence score >90 && age >35
     Name  age   salary  parformance Score
3    moku   40  7000000                 98
4   chadu   50    48000                 56
5     raj   60    67000                 47
6  simran   70    40000                 68
7  moinak   80    56899                 90